// Створіть дві змінні для зберігання значень двох текстових полів.
// Перевірте, чи обидві змінні не є порожніми.
// Якщо обидва поля заповнені, вивести повідомлення "Обидва поля заповнені", якщо ні — "Не всі поля заповнені".

const first = prompt("Введіть текст");
const second = prompt("Введіть знову текст, але інший");
console.log(first.includes(""));
console.log(second.includes(""));

if (first !== "" && second !== "") {
    alert("Обидва поля заповнені");
    console.log("Обидва поля заповнені");
} else {
    alert("Не всі поля заповнені");
    console.log("Не всі поля заповнені");
}

// Створіть дві змінні для зберігання числових значень.
// Обчисліть їх суму.
// Якщо сума більше 10 — виведіть "Сума більша за 10", якщо ні — "Сума менша або дорівнює 10".

const one = Number(prompt("Введіть будь-яке число"));
const two = Number(prompt("Введіть інше будь-яке число"));
console.log(one + two);

if (one + two > 10) {
    alert("Сума більша за 10");
    console.log("Сума більша за 10");
} else {
    alert("Сума менша або дорінює 10");
    console.log("Сума менша або дорівнює 10");
}

// Створіть змінну для зберігання тексту.
// Перевірте, чи містить цей текст слово "JavaScript".
// Якщо містить, виведіть "Текст містить слово JavaScript", якщо ні — "Текст не містить слово JavaScript".

const text = prompt("Введіть речення із або без JavaScript");

if (text.includes("JavaScript")) {
    alert("Текст містить слово JavaScript");
    console.log("Текст містить слово JavaScript");
} else {
    alert("Текст не містить слово JavaScript");
    console.log("Текст не містить слово JavaScript");
}

// Створіть змінну для зберігання числа.
// Перевірте, чи це число більше 10 і менше 20.
// Якщо так — виведіть "Число входить в діапазон від 10 до 20", якщо ні — "Число не входить в діапазон від 10 до 20".

const num = Number(prompt("Введіть число від 1 до 30"));

if (num >= 10 && num <= 20) {
    alert("Число входить в діапазон від 10 до 20");
    console.log("Число входить в діапазон від 10 до 20");
} else {
    alert("Число не входить в діапазон від 10 до 20");
    console.log("Число не входить в діапазон від 10 до 20");
}

// Створіть змінні для зберігання значень полів (ім'я, email, пароль). 
// Перевірте, чи ім'я містить не менше 3 символів, чи email містить символ @ та крапку після нього, а пароль не менше 6 символів.
// Якщо всі умови виконані — виведіть "Перенаправлення на іншу сторінку", якщо ні — "Помилка: неправильне заповнення".

const userName = prompt("Введіть своє ім'я");

if (userName.length >= 3) {
    console.log("Ім'я правильне");
    const userEmail = prompt("Введіть свою електронну пошту");

    if (userEmail.includes("@")) {
        console.log("Електронна пошта правильна");
        const userPassword = prompt("Введіть свій пароль");
        
        if (userPassword.length >= 6) {
            console.log("Пароль правильний і можна перенаправляти");
            alert("Перенаправлення на іншу сторінку");
        } else {
            alert("Помилка: неправильне заповнення");
            console.log("Помилка: неправильне заповнення");
        }

    } else {
        alert("Помилка: неправильне заповнення");
        console.log("Помилка: неправильне заповнення");
    }

} else {
    alert("Помилка: неправильне заповнення");
    console.log("Помилка: неправильне заповнення");
}